starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/modules/src/estimator_kalman.c
// the point at which the dynamics change from stationary to flying
#define IN_FLIGHT_THRUST_THRESHOLD (GRAVITY_MAGNITUDE * 0.1f)
#define IN_FLIGHT_TIME_THRESHOLD (500)

// The bounds on the covariance, these shouldn't be hit, but sometimes are... why?
#define MAX_COVARIANCE (100)
#define MIN_COVARIANCE (1e-6f)

/**
 * Quadrocopter State
 *
 * The internally-estimated state is:
 * - X, Y, Z: the quad's position in the global frame
 * - PX, PY, PZ: the quad's velocity in its body frame
 * - D0, D1, D2: attitude error
 *
 * For more information, refer to the paper
 */

NO_DMA_CCM_SAFE_ZERO_INIT static kalmanCoreData_t coreData;

/**
 * Internal variables. Note that static declaration results in default initialization (to 0)
 */

static bool isInit = false;

static Axis3f accAccumulator;
static float thrustAccumulator;
static Axis3f gyroAccumulator;
static float baroAslAccumulator;
static uint32_t accAccumulatorCount;
static uint32_t thrustAccumulatorCount;
static uint32_t gyroAccumulatorCount;
static uint32_t baroAccumulatorCount;
// Separate accumulator for attitude update — NOT cleared by predictStateForward.
// predictStateForward runs at 500Hz and clears accAccumulator every 2ms, leaving
// only ~1-2 samples for the attitude update. This accumulator is only cleared
// by the attitude update itself, giving ~64 samples/update at 25Hz (1600Hz ODR).
static Axis3f accAttAccumulator;
static uint32_t accAttAccumulatorCount;
bool quadIsFlying = false; // 非静态，供传感器模块访问
static uint32_t lastFlightCmd;
static uint32_t takeoffTime;

// Data used to enable the task and stabilizer loop to run with minimal locking
static state_t taskEstimatorState; // The estimator state produced by the task, copied to the stabilzer when needed.
static Axis3f gyroSnapshot;        // A snpashot of the latest gyro data, used by the task
static Axis3f accSnapshot;         // A snpashot of the latest acc data, used by the task

// Statistics
#define ONE_SECOND 1000
static STATS_CNT_RATE_DEFINE(updateCounter, ONE_SECOND);
static STATS_CNT_RATE_DEFINE(predictionCounter, ONE_SECOND);
static STATS_CNT_RATE_DEFINE(baroUpdateCounter, ONE_SECOND);
static STATS_CNT_RATE_DEFINE(finalizeCounter, ONE_SECOND);
static STATS_CNT_RATE_DEFINE(measurementAppendedCounter, ONE_SECOND);
static STATS_CNT_RATE_DEFINE(measurementNotAppendedCounter, ONE_SECOND);

static rateSupervisor_t rateSupervisorContext;

#define WARNING_HOLD_BACK_TIME M2T(2000)
static uint32_t warningBlockTime = 0;

#ifdef KALMAN_USE_BARO_UPDATE
static const bool useBaroUpdate = true;
#else
static const bool useBaroUpdate = false;
#endif

static void kalmanTask(void *parameters);
static bool predictStateForward(uint32_t osTick, float dt);
static bool updateQueuedMeasurments(const Axis3f *gyro, const uint32_t tick);

STATIC_MEM_TASK_ALLOC_STACK_NO_DMA_CCM_SAFE(kalmanTask, KALMAN_TASK_STACKSIZE);

// --------------------------------------------------

// Called one time during system startup
void estimatorKalmanTaskInit()
{
  distDataQueue = STATIC_MEM_QUEUE_CREATE(distDataQueue);
  posDataQueue = STATIC_MEM_QUEUE_CREATE(posDataQueue);
  poseDataQueue = STATIC_MEM_QUEUE_CREATE(poseDataQueue);
  tdoaDataQueue = STATIC_MEM_QUEUE_CREATE(tdoaDataQueue);
  velocityDataQueue = STATIC_MEM_QUEUE_CREATE(velocityDataQueue);
  tofDataQueue = STATIC_MEM_QUEUE_CREATE(tofDataQueue);
  heightDataQueue = STATIC_MEM_QUEUE_CREATE(heightDataQueue);
  yawErrorDataQueue = STATIC_MEM_QUEUE_CREATE(yawErrorDataQueue);
  // sweepAnglesDataQueue = STATIC_MEM_QUEUE_CREATE(sweepAnglesDataQueue);

  vSemaphoreCreateBinary(runTaskSemaphore);

  dataMutex = xSemaphoreCreateMutexStatic(&dataMutexBuffer);

  STATIC_MEM_TASK_CREATE(kalmanTask, kalmanTask, KALMAN_TASK_NAME, NULL, KALMAN_TASK_PRI);

  isInit = true;
}

bool estimatorKalmanTaskTest()
{
  return isInit;
}

static void kalmanTask(void *parameters)
{
  systemWaitStart();

  uint32_t lastPrediction = xTaskGetTickCount();
  uint32_t nextPrediction = xTaskGetTickCount();
  uint32_t lastPNUpdate = xTaskGetTickCount();
  uint32_t nextBaroUpdate = xTaskGetTickCount();
  uint32_t nextAccelAttitudeUpdate = xTaskGetTickCount();

  // rateSupervisor 配置：期望每秒 490-510 次预测（对应 500Hz）
  rateSupervisorInit(&rateSupervisorContext, xTaskGetTickCount(), M2T(1000), 490, 510, 1);

  while (true)
  {
    xSemaphoreTake(runTaskSemaphore, portMAX_DELAY);

    // If the client triggers an estimator reset via parameter update
    if (coreData.resetEstimation)
    {
      estimatorKalmanInit();
      paramSetInt(paramGetVarId("kalman", "resetEstimation"), 0);
    }

    // Tracks whether an update to the state has been made, and the state therefore requires finalization
    bool doneUpdate = false;

    uint32_t osTick = xTaskGetTickCount(); // would be nice if this had a precision higher than 1ms...

#ifdef KALMAN_DECOUPLE_XY
    kalmanCoreDecoupleXY(&coreData);
#endif

    // Run the system dynamics to predict the state forward.
    if (osTick >= nextPrediction)
    { // update at the PREDICT_RATE
      float dt = T2S(osTick - lastPrediction);
      if (predictStateForward(osTick, dt))
      {
        lastPrediction = osTick;
        doneUpdate = true;
        STATS_CNT_RATE_EVENT(&predictionCounter);
      }

      nextPrediction = osTick + S2T(1.0f / PREDICT_RATE);

      if (!rateSupervisorValidate(&rateSupervisorContext, T2M(osTick)))
      {
        // ESP_LOGI("ESTKALMAN", "WARNING: Kalman prediction rate low (%u)", rateSupervisorLatestCount(&rateSupervisorContext));
      }
    }

    /**
     * Add process noise every loop, rather than every prediction
     */
    {
      float dt = T2S(osTick - lastPNUpdate);
      if (dt > 0.0f)
      {
        kalmanCoreAddProcessNoise(&coreData, dt);
        lastPNUpdate = osTick;
      }
    }

    /**
     * Update the state estimate with the barometer measurements
     */
    // Accumulate the barometer measurements
    if (useBaroUpdate)
    {
      if (osTick > nextBaroUpdate // update at BARO_RATE
          && baroAccumulatorCount > 0)
      {
        xSemaphoreTake(dataMutex, portMAX_DELAY);
        float baroAslAverage = baroAslAccumulator / baroAccumulatorCount;
        baroAslAccumulator = 0;
        baroAccumulatorCount = 0;
        xSemaphoreGive(dataMutex);

        // 校准逻辑已移至 kalmanCoreUpdateWithBaro 内部
        // 自动累积样本并计算参考高度
        kalmanCoreUpdateWithBaro(&coreData, baroAslAverage, quadIsFlying);

        nextBaroUpdate = osTick + S2T(1.0f / BARO_RATE);
        doneUpdate = true;

        STATS_CNT_RATE_EVENT(&baroUpdateCounter);
      }
    }

    /**
     * Update attitude using accelerometer (gravity direction)
     * This provides attitude correction when no external sensors (TOF/flow) are available
     */
    if (osTick > nextAccelAttitudeUpdate && accAttAccumulatorCount > 0)
    {
      xSemaphoreTake(dataMutex, portMAX_DELAY);
      Axis3f accAvg;
      accAvg.x = accAttAccumulator.x / accAttAccumulatorCount;
      accAvg.y = accAttAccumulator.y / accAttAccumulatorCount;
      accAvg.z = accAttAccumulator.z / accAttAccumulatorCount;

      // 清零独立累加器（不影响 predict 使用的 accAccumulator）
      accAttAccumulator = (Axis3f){.axis = {0}};
      accAttAccumulatorCount = 0;
      xSemaphoreGive(dataMutex);

      // Dynamic standard deviation: trust decreases as acceleration deviates from 1g
      // Base stdDev=0.15 (R=0.0225) matched to measNoiseGyro_rollpitch=0.07:
      //   Steady-state P grows ~2e-4 between 25Hz updates
      //   K = P/(P+R) ≈ 0.01 → smooth correction, <0.1° noise contribution
      // At 0.95g deviation=0.05 -> stdDev=0.55 (moderate)
      // At 0.90g deviation=0.10 -> stdDev=0.95 (weak, near gate threshold)
      float accMagAvg = sqrtf(accAvg.x * accAvg.x + accAvg.y * accAvg.y + accAvg.z * accAvg.z);
      float accelDeviation = fabsf(accMagAvg - 1.0f);
      float accelAttitudeStdDev = 0.15f + accelDeviation * 8.0f;
      kalmanCoreUpdateWithAccel(&coreData, &accAvg, accelAttitudeStdDev);

      nextAccelAttitudeUpdate = osTick + S2T(1.0f / ACCEL_ATTITUDE_RATE);
      doneUpdate = true;
    }

    {
      Axis3f gyro;
      xSemaphoreTake(dataMutex, portMAX_DELAY);
      memcpy(&gyro, &gyroSnapshot, sizeof(gyro));
      xSemaphoreGive(dataMutex);

