starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/modules/src/estimator_kalman.c
  heightMeasurement_t height;
  while (stateEstimatorHasHeightPacket(&height))
  {
    kalmanCoreUpdateWithAbsoluteHeight(&coreData, &height);
    doneUpdate = true;
  }

  distanceMeasurement_t dist;
  while (stateEstimatorHasDistanceMeasurement(&dist))
  {
    kalmanCoreUpdateWithDistance(&coreData, &dist);
    doneUpdate = true;
  }

  positionMeasurement_t pos;
  while (stateEstimatorHasPositionMeasurement(&pos))
  {
    kalmanCoreUpdateWithPosition(&coreData, &pos);
    doneUpdate = true;
  }

  poseMeasurement_t pose;
  while (stateEstimatorHasPoseMeasurement(&pose))
  {
    kalmanCoreUpdateWithPose(&coreData, &pose);
    doneUpdate = true;
  }

  tdoaMeasurement_t tdoa;
  while (stateEstimatorHasTDOAPacket(&tdoa))
  {
    kalmanCoreUpdateWithTDOA(&coreData, &tdoa);
    doneUpdate = true;
  }

  velocityMeasurement_t vel;
  while (stateEstimatorHasVelocityPacket(&vel))
  {
    kalmanCoreUpdateWithVelocity(&coreData, &vel);
    doneUpdate = true;
  }

  // sweepAngleMeasurement_t angles;
  // while (stateEstimatorHasSweepAnglesPacket(&angles))
  // {
  //   kalmanCoreUpdateWithSweepAngles(&coreData, &angles, tick);
  //   doneUpdate = true;
  // }

  return doneUpdate;
}

// Called when this estimator is activated
void estimatorKalmanInit(void)
{
  xQueueReset(distDataQueue);
  xQueueReset(posDataQueue);
  xQueueReset(poseDataQueue);
  xQueueReset(tdoaDataQueue);
  xQueueReset(velocityDataQueue);
  xQueueReset(tofDataQueue);

  xSemaphoreTake(dataMutex, portMAX_DELAY);
  accAccumulator = (Axis3f){.axis = {0}};
  gyroAccumulator = (Axis3f){.axis = {0}};
  thrustAccumulator = 0;
  baroAslAccumulator = 0;

  accAccumulatorCount = 0;
  gyroAccumulatorCount = 0;
  thrustAccumulatorCount = 0;
  baroAccumulatorCount = 0;
  accAttAccumulator = (Axis3f){.axis = {0}};
  accAttAccumulatorCount = 0;
  xSemaphoreGive(dataMutex);

  kalmanCoreInit(&coreData);
}

bool estimatorKalmanIsBaroCalibrated(void)
{
  return kalmanCoreIsBaroCalibrated();
}

static bool appendMeasurement(xQueueHandle queue, void *measurement)
{
  portBASE_TYPE result;
  bool isInInterrupt = 0; // TODO:= (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;

  if (isInInterrupt)
  {
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    result = xQueueSendFromISR(queue, measurement, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken == pdTRUE)
    {
      portYIELD();
    }
  }
  else
  {
    result = xQueueSend(queue, measurement, 0);
  }

  if (result == pdTRUE)
  {
    STATS_CNT_RATE_EVENT(&measurementAppendedCounter);
    return true;
  }
  else
  {
    STATS_CNT_RATE_EVENT(&measurementNotAppendedCounter);
    return true;
  }
}

bool estimatorKalmanEnqueueTDOA(const tdoaMeasurement_t *uwb)
{
  ASSERT(isInit);
  return appendMeasurement(tdoaDataQueue, (void *)uwb);
}

bool estimatorKalmanEnqueuePosition(const positionMeasurement_t *pos)
{
  ASSERT(isInit);
  return appendMeasurement(posDataQueue, (void *)pos);
}

bool estimatorKalmanEnqueuePose(const poseMeasurement_t *pose)
{
  ASSERT(isInit);
  return appendMeasurement(poseDataQueue, (void *)pose);
}

bool estimatorKalmanEnqueueDistance(const distanceMeasurement_t *dist)
{
  ASSERT(isInit);
  return appendMeasurement(distDataQueue, (void *)dist);
}

bool estimatorKalmanEnqueueVelocity(const velocityMeasurement_t *vel)
{
  // Direct velocity measurement from MTF01 optical flow (m/s)
  ASSERT(isInit);
  return appendMeasurement(velocityDataQueue, (void *)vel);
}

bool estimatorKalmanEnqueueTOF(const tofMeasurement_t *tof)
{
  // A distance (distance) [m] to the ground along the z_B axis.
  ASSERT(isInit);
  return appendMeasurement(tofDataQueue, (void *)tof);
}

bool estimatorKalmanEnqueueAbsoluteHeight(const heightMeasurement_t *height)
{
  // A distance (height) [m] to the ground along the z axis.
  ASSERT(isInit);
  return appendMeasurement(heightDataQueue, (void *)height);
}

bool estimatorKalmanEnqueueYawError(const yawErrorMeasurement_t *error)
{
  ASSERT(isInit);
  return appendMeasurement(yawErrorDataQueue, (void *)error);
}

// bool estimatorKalmanEnqueueSweepAngles(const sweepAngleMeasurement_t *angles)
// {
//   ASSERT(isInit);
//   return appendMeasurement(sweepAnglesDataQueue, (void *)angles);
// }

bool estimatorKalmanTest(void)
{
  return isInit;
}

void estimatorKalmanGetEstimatedPos(point_t *pos)
{
  pos->x = coreData.S[KC_STATE_X];
  pos->y = coreData.S[KC_STATE_Y];
  pos->z = coreData.S[KC_STATE_Z];
}

void estimatorKalmanGetEstimatedRot(float *rotationMatrix)
{
  memcpy(rotationMatrix, coreData.R, 9 * sizeof(float));
}

// Temporary development groups
LOG_GROUP_START(kalman_states)
LOG_ADD(LOG_FLOAT, ox, &coreData.S[KC_STATE_X])
LOG_ADD(LOG_FLOAT, oy, &coreData.S[KC_STATE_Y])
LOG_ADD(LOG_FLOAT, vx, &coreData.S[KC_STATE_PX])
LOG_ADD(LOG_FLOAT, vy, &coreData.S[KC_STATE_PY])
LOG_GROUP_STOP(kalman_states)

// Stock log groups
LOG_GROUP_START(kalman)
LOG_ADD(LOG_UINT8, inFlight, &quadIsFlying)
LOG_ADD(LOG_FLOAT, stateX, &coreData.S[KC_STATE_X])
LOG_ADD(LOG_FLOAT, stateY, &coreData.S[KC_STATE_Y])
LOG_ADD(LOG_FLOAT, stateZ, &coreData.S[KC_STATE_Z])
LOG_ADD(LOG_FLOAT, statePX, &coreData.S[KC_STATE_PX])
LOG_ADD(LOG_FLOAT, statePY, &coreData.S[KC_STATE_PY])
LOG_ADD(LOG_FLOAT, statePZ, &coreData.S[KC_STATE_PZ])
LOG_ADD(LOG_FLOAT, stateD0, &coreData.S[KC_STATE_D0])
LOG_ADD(LOG_FLOAT, stateD1, &coreData.S[KC_STATE_D1])
LOG_ADD(LOG_FLOAT, stateD2, &coreData.S[KC_STATE_D2])
LOG_ADD(LOG_FLOAT, varX, &coreData.P[KC_STATE_X][KC_STATE_X])
LOG_ADD(LOG_FLOAT, varY, &coreData.P[KC_STATE_Y][KC_STATE_Y])
LOG_ADD(LOG_FLOAT, varZ, &coreData.P[KC_STATE_Z][KC_STATE_Z])
LOG_ADD(LOG_FLOAT, varPX, &coreData.P[KC_STATE_PX][KC_STATE_PX])
LOG_ADD(LOG_FLOAT, varPY, &coreData.P[KC_STATE_PY][KC_STATE_PY])
LOG_ADD(LOG_FLOAT, varPZ, &coreData.P[KC_STATE_PZ][KC_STATE_PZ])
LOG_ADD(LOG_FLOAT, varD0, &coreData.P[KC_STATE_D0][KC_STATE_D0])
LOG_ADD(LOG_FLOAT, varD1, &coreData.P[KC_STATE_D1][KC_STATE_D1])
LOG_ADD(LOG_FLOAT, varD2, &coreData.P[KC_STATE_D2][KC_STATE_D2])
LOG_ADD(LOG_FLOAT, q0, &coreData.q[0])
LOG_ADD(LOG_FLOAT, q1, &coreData.q[1])
LOG_ADD(LOG_FLOAT, q2, &coreData.q[2])
LOG_ADD(LOG_FLOAT, q3, &coreData.q[3])

STATS_CNT_RATE_LOG_ADD(rtUpdate, &updateCounter)
STATS_CNT_RATE_LOG_ADD(rtPred, &predictionCounter)
STATS_CNT_RATE_LOG_ADD(rtBaro, &baroUpdateCounter)
STATS_CNT_RATE_LOG_ADD(rtFinal, &finalizeCounter)
STATS_CNT_RATE_LOG_ADD(rtApnd, &measurementAppendedCounter)
STATS_CNT_RATE_LOG_ADD(rtRej, &measurementNotAppendedCounter)
LOG_GROUP_STOP(kalman)

PARAM_GROUP_START(kalman)
PARAM_ADD(PARAM_UINT8, resetEstimation, &coreData.resetEstimation)
PARAM_ADD(PARAM_UINT8, quadIsFlying, &quadIsFlying)
PARAM_GROUP_STOP(kalman)
